public/org-agenda-el.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-12-24 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Org Agenda Templates</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Mike Hostetler">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="icon" type="image/x-icon" href="/favicon.ico" />
<link rel="stylesheet" href="style.css" type="text/css">
</head>
<body>
<main id="content">
<header>
<h1 class="title">Org Agenda Templates</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2f616f9">Prologue</a></li>
<li><a href="#org73b0bb9">Menu Items</a></li>
<li><a href="#org3b374dc">todo keyword</a></li>
<li><a href="#org4201aeb">super agenda</a></li>
<li><a href="#org1ec1f25">custom commands</a></li>
</ul>
</div>
</nav>

<section id="outline-container-org2f616f9" class="outline-2">
<h2 id="org2f616f9">Prologue</h2>
<div class="outline-text-2" id="text-org2f616f9">
<p>
I&rsquo;m starting to do more with org-agenda.
</p>

<p>
First, and most importantly &#x2013; make my Agenda files under <code>~/org</code>. My knowledge base is under <code>~/org-kb</code> &#x2013; I have found having fewer files to search for agenda items is much faster
</p>

<div class="org-src-container">
<pre class="src src-elisp">
(<span class="org-keyword">setq</span> org-agenda-files '(<span class="org-string">"~/org/"</span> <span class="org-string">"~/pDrive/org/tasks/"</span>))
</pre>
</div>
</div>
</section>

<section id="outline-container-org73b0bb9" class="outline-2">
<h2 id="org73b0bb9">Menu Items</h2>
<div class="outline-text-2" id="text-org73b0bb9">
<p>
The idea behind the menu items come from
<a href="https://joshrollinswrites.com/help-desk-head-desk/sub-menus-in-org/">https://joshrollinswrites.com/help-desk-head-desk/sub-menus-in-org/</a>
</p>

<p>
It seems that Mr Rollins dived into the orgmode docs and found something good:
</p>


<div class="org-src-container">
<pre class="src src-elisp">(<span class="org-keyword">setq</span> org-capture-templates
      '((<span class="org-string">"t"</span> <span class="org-string">"Todo"</span> )
      (<span class="org-string">"tw"</span> <span class="org-string">"Well"</span>  entry (file+headline <span class="org-string">"~/org/WellDot.org"</span> <span class="org-string">"Welldot Tasks"</span>)
         <span class="org-string">"** TODO %?</span>
<span class="org-string">:PROPERTIES:</span>
<span class="org-string">:ID:       %(shell-command-to-string \"uuidgen\"):CREATED:  %U</span>
<span class="org-string">%i</span>
<span class="org-string">%a</span>
<span class="org-string">:END:"</span> <span class="org-builtin">:prepend</span> t)
      (<span class="org-string">"tf"</span> <span class="org-string">"Farwell"</span>  entry (file+headline <span class="org-string">"~/org/FarwellIrrigation.org"</span> <span class="org-string">"Farwell Tasks"</span>)
         <span class="org-string">"** TODO %?</span>
<span class="org-string">:PROPERTIES:</span>
<span class="org-string">:ID:       %(shell-command-to-string \"uuidgen\"):CREATED:  %U</span>
<span class="org-string">%i</span>
<span class="org-string">%a</span>
<span class="org-string">:END:"</span> <span class="org-builtin">:prepend</span> t)

      (<span class="org-string">"tv"</span> <span class="org-string">"VoterInformation"</span>  entry (file+headline <span class="org-string">"~/org/VoterInformation.org"</span> <span class="org-string">"Farwell Tasks"</span>)
         <span class="org-string">"** TODO %?</span>
<span class="org-string">:PROPERTIES:</span>
<span class="org-string">:ID:       %(shell-command-to-string \"uuidgen\"):CREATED:  %U</span>
<span class="org-string">%i</span>
<span class="org-string">%a</span>
<span class="org-string">:END:"</span> <span class="org-builtin">:prepend</span> t)

      (<span class="org-string">"ts"</span> <span class="org-string">"Shift Worship"</span>  entry (file+headline <span class="org-string">"~/org/ShiftTasks.org"</span> <span class="org-string">"Shit Tasks"</span>)
         <span class="org-string">"** TODO %?</span>
<span class="org-string">:PROPERTIES:</span>
<span class="org-string">:ID:       %(shell-command-to-string \"uuidgen\"):CREATED:  %U</span>
<span class="org-string">%i</span>
<span class="org-string">%a</span>
<span class="org-string">:END:"</span> <span class="org-builtin">:prepend</span> t)
      (<span class="org-string">"tp"</span> <span class="org-string">"Powerhouse"</span>  entry (file+headline <span class="org-string">"~/org/Powerhouse.org"</span> <span class="org-string">"Powerhouse Tasks"</span>)
         <span class="org-string">"** TODO %?</span>
<span class="org-string">:PROPERTIES:</span>
<span class="org-string">:ID:       %(shell-command-to-string \"uuidgen\"):CREATED:  %U</span>
<span class="org-string">%i</span>
<span class="org-string">%a</span>
<span class="org-string">:END:"</span> <span class="org-builtin">:prepend</span> t)
      (<span class="org-string">"tt"</span> <span class="org-string">"Misc"</span> entry (file+headline <span class="org-string">"~/pdrive/org/tasks/task.org"</span> <span class="org-string">"Tasks"</span>)
         <span class="org-string">"** TODO %?</span>
<span class="org-string">:PROPERTIES:</span>
<span class="org-string">:ID:       %(shell-command-to-string \"uuidgen\"):CREATED:  %U</span>
<span class="org-string">%i</span>
<span class="org-string">%a</span>
<span class="org-string">:END:"</span> <span class="org-builtin">:prepend</span> t)
    (<span class="org-string">"j"</span> <span class="org-string">"Journal"</span> entry (file+datetree <span class="org-string">"~/pdrive/org/tasks/journal.org"</span>)
         <span class="org-string">"* %?</span>
<span class="org-string">:PROPERTIES:</span>
<span class="org-string">:ID:       %(shell-command-to-string \"uuidgen\"):CREATED:  %U</span>
<span class="org-string">%i</span>
<span class="org-string">%a</span>
<span class="org-string">:END:"</span> <span class="org-builtin">:prepend</span> t)
      (<span class="org-string">"b"</span> <span class="org-string">"Bookmark"</span> entry (file+headline <span class="org-string">"~/pdrive/org/tasks/links.org"</span> <span class="org-string">"Bookmarks"</span>)
            <span class="org-string">"* %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n"</span> <span class="org-builtin">:empty-lines</span> 1)
  )
)

</pre>
</div>
</div>
</section>

<section id="outline-container-org3b374dc" class="outline-2">
<h2 id="org3b374dc">todo keyword</h2>
<div class="outline-text-2" id="text-org3b374dc">
<p>
This is a odd combination between <a href="https://github.com/jwiegley/dot-emacs/blob/master/org-settings.el">John Wigley&rsquo;s sample file</a> and <a href="http://jr0cket.co.uk/2013/08/defining-custom-workflow-with-Emacs-org-mode.html.html">this really thorough overview</a>
</p>

<p>
Basically I made my own labels (well, jwigley did).
</p>
<div class="org-src-container">
<pre class="src src-elisp">
(<span class="org-keyword">setq</span> org-todo-keyword-faces
   '((
    <span class="org-string">"TODO"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"dark orange"</span> <span class="org-builtin">:weight</span> bold)
  <span class="org-comment-delimiter">;   </span><span class="org-comment">("EPIC" :foreground "deep sky blue" :weight bold)</span>
<span class="org-comment-delimiter">;     </span><span class="org-comment">("STORY" :foreground "royal blue" :weight bold)</span>
     <span class="org-comment-delimiter">;</span><span class="org-comment">("RECUR" :foreground "cornflowerblue" :weight bold)</span>
     <span class="org-comment-delimiter">;</span><span class="org-comment">("APPT" :foreground "light blue" :weight bold)</span>
     <span class="org-comment-delimiter">;</span><span class="org-comment">("NOTE" :foreground "brown" :weight bold)</span>
     <span class="org-comment-delimiter">;</span><span class="org-comment">("STARTED" :foreground "dark orange" :weight bold)</span>
     <span class="org-comment-delimiter">;</span><span class="org-comment">("WAITING" :foreground "red" :weight bold)</span>
     <span class="org-comment-delimiter">;</span><span class="org-comment">("DELEGATED" :foreground "dark violet" :weight bold)</span>
     <span class="org-comment-delimiter">;</span><span class="org-comment">("DEFERRED" :foreground "dark violet" :weight bold)</span>
     <span class="org-comment-delimiter">;</span><span class="org-comment">("SOMEDAY" :foreground "brown" :weight bold)</span>
     <span class="org-comment-delimiter">;</span><span class="org-comment">("PROJECT" :foreground "#088e8e" :weight bold)</span>
     (<span class="org-string">"DONE"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"#088e8e"</span> <span class="org-builtin">:weight</span> bold)
    <span class="org-comment-delimiter">;</span><span class="org-comment">("TO-READ" :foreground "dark orange" :weight bold)</span>
    <span class="org-comment-delimiter">;</span><span class="org-comment">("FINISHED" :foreground "royal blue" :weight bold)</span>
)

)

(<span class="org-keyword">setq</span> org-todo-keywords
   '((sequence <span class="org-string">"TODO"</span> <span class="org-string">"TO-READ"</span> <span class="org-string">"|"</span> <span class="org-string">"DONE"</span>  <span class="org-string">"READ"</span>))
)


</pre>
</div>
</div>
</section>
<section id="outline-container-org4201aeb" class="outline-2">
<h2 id="org4201aeb">super agenda</h2>
<div class="outline-text-2" id="text-org4201aeb">
<p>
Using keywords from above, we can use <a href="https://github.com/alphapapa/org-super-agenda">org-super-agenda</a> to make this really fancy
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">; </span><span class="org-comment">this no workie</span>
(<span class="org-keyword">require</span> '<span class="org-constant">org-super-agenda</span>)
(<span class="org-keyword">let</span> ((org-super-agenda-groups
       '(<span class="org-comment-delimiter">;; </span><span class="org-comment">Each group has an implicit boolean OR operator between its selectors.</span>
         (<span class="org-builtin">:name</span> <span class="org-string">"Today"</span>  <span class="org-comment-delimiter">; </span><span class="org-comment">Optionally specify section name</span>
                <span class="org-builtin">:time-grid</span> t  <span class="org-comment-delimiter">; </span><span class="org-comment">Items that appear on the time grid</span>
                <span class="org-builtin">:todo</span> <span class="org-string">"TODAY"</span>)  <span class="org-comment-delimiter">; </span><span class="org-comment">Items that have this TODO keyword</span>
         (<span class="org-builtin">:name</span> <span class="org-string">"Important"</span>
                <span class="org-comment-delimiter">;; </span><span class="org-comment">Single arguments given alone</span>
                <span class="org-builtin">:tag</span> <span class="org-string">"bills"</span>
                <span class="org-builtin">:priority</span> <span class="org-string">"A"</span>)
         <span class="org-comment-delimiter">;; </span><span class="org-comment">Set order of multiple groups at once</span>
         (<span class="org-builtin">:order-multi</span> (2 (<span class="org-builtin">:name</span> <span class="org-string">"Shopping in town"</span>
                                 <span class="org-comment-delimiter">;; </span><span class="org-comment">Boolean AND group matches items that match all subgroups</span>
                                 <span class="org-builtin">:and</span> (<span class="org-builtin">:tag</span> <span class="org-string">"shopping"</span> <span class="org-builtin">:tag</span> <span class="org-string">"@town"</span>))
                          (<span class="org-builtin">:name</span> <span class="org-string">"Food-related"</span>
                                 <span class="org-comment-delimiter">;; </span><span class="org-comment">Multiple args given in list with implicit OR</span>
                                 <span class="org-builtin">:tag</span> (<span class="org-string">"food"</span> <span class="org-string">"dinner"</span>))
                          (<span class="org-builtin">:name</span> <span class="org-string">"Space-related (non-moon-or-planet-related)"</span>
                                 <span class="org-comment-delimiter">;; </span><span class="org-comment">Regexps match case-insensitively on the entire entry</span>
                                 <span class="org-builtin">:and</span> (<span class="org-builtin">:regexp</span> (<span class="org-string">"space"</span> <span class="org-string">"NASA"</span>)
                                               <span class="org-comment-delimiter">;; </span><span class="org-comment">Boolean NOT also has implicit OR between selectors</span>
                                               <span class="org-builtin">:not</span> (<span class="org-builtin">:regexp</span> <span class="org-string">"moon"</span> <span class="org-builtin">:tag</span> <span class="org-string">"planet"</span>)))))
         <span class="org-comment-delimiter">;; </span><span class="org-comment">Groups supply their own section names when none are given</span>
         (<span class="org-builtin">:todo</span> <span class="org-string">"WAITING"</span> <span class="org-builtin">:order</span> 8)  <span class="org-comment-delimiter">; </span><span class="org-comment">Set order of this section</span>
         (<span class="org-builtin">:todo</span> (<span class="org-string">"SOMEDAY"</span> <span class="org-string">"TO-READ"</span> <span class="org-string">"CHECK"</span> <span class="org-string">"TO-WATCH"</span> <span class="org-string">"WATCHING"</span>)
                <span class="org-comment-delimiter">;; </span><span class="org-comment">Show this group at the end of the agenda (since it has the</span>
                <span class="org-comment-delimiter">;; </span><span class="org-comment">highest number). If you specified this group last, items</span>
                <span class="org-comment-delimiter">;; </span><span class="org-comment">with these todo keywords that e.g. have priority A would be</span>
                <span class="org-comment-delimiter">;; </span><span class="org-comment">displayed in that group instead, because items are grouped</span>
                <span class="org-comment-delimiter">;; </span><span class="org-comment">out in the order the groups are listed.</span>
                <span class="org-builtin">:order</span> 9)
         (<span class="org-builtin">:priority&lt;=</span> <span class="org-string">"B"</span>
                      <span class="org-comment-delimiter">;; </span><span class="org-comment">Show this section after "Today" and "Important", because</span>
                      <span class="org-comment-delimiter">;; </span><span class="org-comment">their order is unspecified, defaulting to 0. Sections</span>
                      <span class="org-comment-delimiter">;; </span><span class="org-comment">are displayed lowest-number-first.</span>
                      <span class="org-builtin">:order</span> 1)
         <span class="org-comment-delimiter">;; </span><span class="org-comment">After the last group, the agenda will display items that didn't</span>
         <span class="org-comment-delimiter">;; </span><span class="org-comment">match any of these groups, with the default order position of 99</span>
         )))

(org-agenda nil <span class="org-string">"a"</span>))


</pre>
</div>
</div>
</section>
<section id="outline-container-org1ec1f25" class="outline-2">
<h2 id="org1ec1f25">custom commands</h2>
<div class="outline-text-2" id="text-org1ec1f25">
<p>
Got this from <a href="https://orgmode.org/worg/org-tutorials/org-custom-agenda-commands.html">the Org Worg</a>
</p>

<div class="org-src-container">
<pre class="src src-elisp">
(<span class="org-keyword">setq</span> org-agenda-custom-commands
      '(
      (<span class="org-string">"w"</span> <span class="org-string">"Well Tasks"</span> tags-todo <span class="org-string">"well"</span>
         ((org-agenda-files '(<span class="org-string">"~/org/"</span> <span class="org-string">"~/pDrive/org/tasks/task.org"</span>))
          (org-agenda-sorting-strategy '(priority-up effort-down)))
         (<span class="org-string">"~/org/wellco.html"</span>))
        (<span class="org-string">"p"</span> <span class="org-string">"Powerhouse"</span> tags-todo <span class="org-string">"powerhouse"</span>
         ((org-agenda-files '(<span class="org-string">"~/org/"</span> <span class="org-string">"~/pDrive/org/tasks/task.org"</span>))
          (org-agenda-sorting-strategy '(priority-up effort-down)))
         (<span class="org-string">"~/org/powerhouse.html"</span>))
        (<span class="org-string">"v"</span> <span class="org-string">"VoterInformation"</span> tags-todo <span class="org-string">"vip"</span>
         ((org-agenda-files '(<span class="org-string">"~/org/"</span> <span class="org-string">"~/pDrive/org/tasks/task.org"</span>))
          (org-agenda-sorting-strategy '(priority-up effort-down)))
         (<span class="org-string">"~/org/voterinformation.html"</span>))
        (<span class="org-string">"s"</span> <span class="org-string">"Shift"</span> tags-todo <span class="org-string">"shift"</span>
         ((org-agenda-files '(<span class="org-string">"~/org/"</span> <span class="org-string">"~/pDrive/org/tasks/task.org"</span>))
          (org-agenda-sorting-strategy '(priority-up effort-down)))
         (<span class="org-string">"~/org/shiftworship.html"</span>))

        ))
</pre>
</div>
</div>
</section>
</main>
<footer id="postamble" class="status">
<hr>
<p>
<p class="Source">Source: <a href="https://github.com/squarepegsys/literate-dotfiles/blob/master/org-agenda-el.org">org-agenda-el.org</a></p><p>Return to <a href="index.html">index</a>.</p>
</footer>
</body>
</html>
